hardbyte/models/RegisterForm.php

    public function signup()
    {
        if ($this->validate()) {

                $_user = new User();
                $_user->username = $this->username;
                $_user->email = $this->email;
                $_user->especialist = $this->especialist;
                $_user->web = $this->web;

                $_user->created_at = time();
---
INSERT INTO `user` (`username`, `email`, `especialist`, `web`, `created_at`, `updated_at`, `status`, `admin`, `password_hash`, `auth_key`) VALUES ('ale', '2345678', 'wertyu', 'ertyui', 1645553663, 1645553663, 10, 'N', '$2y$13$0gS8z2RmHzcWGIAEcZzBv.do7M51X3e3sYmZLfMm9tmwf0iND8gh.', 'xbAWKOvgfLdfquSktwUjoE3ETfVVWYc5')