hardbyte/models/User.php

    public static function findByEmail($email)
    {
        return self::find()->andWhere(['email' => $email])->one();
---
SELECT * FROM `user` WHERE `email`='password'